prife/stm32f10x_demo/drivers/msd.c
/******************** (C) COPYRIGHT 2008 STMicroelectronics ********************
* File Name          : msd.c
* Author             : MCD Application Team
* Version            : V2.1
* Date               : 05/30/2008
* Description        : MSD card driver source file.
*                      Pin assignment:
*             ----------------------------------------------
*             |  STM32F10x    |     MSD          Pin        |
*             ----------------------------------------------
*             | P0.4          |   ChipSelect      1         |
*             | P0.1 / MOSI   |   DataIn          2         |
*             |               |   GND             3 (0 V)   |
*             |               |   VDD             4 (3.3 V) |
*             | P0.2 / SCLK   |   Clock           5         |
*             |               |   GND             6 (0 V)   |
*             | P0.0 / MISO   |   DataOut         7         |
*             -----------------------------------------------
********************************************************************************
* THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
* WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE TIME.
* AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY DIRECT,
* INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING FROM THE
* CONTENT OF SUCH SOFTWARE AND/OR THE USE MADE BY CUSTOMERS OF THE CODING
* INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
* FOR MORE INFORMATION PLEASE CAREFULLY READ THE LICENSE AGREEMENT FILE LOCATED
* IN THE ROOT DIRECTORY OF THIS FIRMWARE PACKAGE.
*******************************************************************************/

/* Includes ------------------------------------------------------------------*/
#include "msd.h"
#include <stm32f10x_spi.h>

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Select MSD Card: ChipSelect pin low  */
#define MSD_CS_LOW()    GPIO_ResetBits(GPIOA, GPIO_Pin_4)
/* Deselect MSD Card: ChipSelect pin high */
#define MSD_CS_HIGH()   GPIO_SetBits(GPIOA, GPIO_Pin_4)
#define MSD_CS_PIN      GPIO_Pin_4
#define MSD_CS_PORT     GPIOA
#define RCC_APB2Periph_MSD_CS  RCC_APB2Periph_GPIOA

#define MSD_SPI         SPI1
#define MSD_RCC_SPI     RCC_APB2Periph_SPI1

/* SD detected pin */
#define SD_CD_PORT       GPIOB
#define SD_CD_PIN        GPIO_Pin_0
#define RCC_APB2Periph_SD_CD    RCC_APB2Periph_GPIOB

/* SD power pin */
#define SD_PWR_PORT       GPIOC
#define SD_PWR_PIN        GPIO_Pin_4
#define RCC_APB2Periph_SD_PWR    RCC_APB2Periph_GPIOC
#define sd_power_on()     GPIO_ResetBits(SD_PWR_PORT, SD_PWR_PIN)

/* Private function prototypes -----------------------------------------------*/
static void SPI_Config(void);
/* Private functions ---------------------------------------------------------*/

/*******************************************************************************
* Function Name  : MSD_Init
* Description    : Initializes the MSD/SD communication.
* Input          : None
* Output         : None
* Return         : The MSD Response: - MSD_RESPONSE_FAILURE: Sequence failed
*                                    - MSD_RESPONSE_NO_ERROR: Sequence succeed
*******************************************************************************/
u8 MSD_Init(void)
{
    u32 i = 0;

    /* Initialize SPI */
    SPI_Config();
    /* MSD chip select high */
    MSD_CS_HIGH();
    /* Send dummy byte 0xFF, 10 times with CS high*/
    /* rise CS and MOSI for 80 clocks cycles */
    for (i = 0; i <= 9; i++)
    {
        /* Send dummy byte 0xFF */
        MSD_WriteByte(DUMMY);
    }
    /*------------Put MSD in SPI mode--------------*/
    /* MSD initialized and set to SPI mode properly */
    return (MSD_GoIdleState());
}

/*******************************************************************************
* Function Name  : MSD_WriteBlock
* Description    : Writes a block on the MSD
* Input          : - pBuffer : pointer to the buffer containing the data to be
*                    written on the MSD.
*                  - WriteAddr : address to write on.
*                  - NumByteToWrite: number of data to write
* Output         : None
* Return         : The MSD Response: - MSD_RESPONSE_FAILURE: Sequence failed
*                                    - MSD_RESPONSE_NO_ERROR: Sequence succeed
*******************************************************************************/
u8 MSD_WriteBlock(u8 *pBuffer, u32 WriteAddr, u16 NumByteToWrite)
{
    u32 i = 0;
    u8 rvalue = MSD_RESPONSE_FAILURE;

    /* MSD chip select low */
    MSD_CS_LOW();
    /* Send CMD24 (MSD_WRITE_BLOCK) to write multiple block */
    MSD_SendCmd(MSD_WRITE_BLOCK, WriteAddr, 0xFF);

    /* Check if the MSD acknowledged the write block command: R1 response (0x00: no errors) */
    if (!MSD_GetResponse(MSD_RESPONSE_NO_ERROR))
    {
        /* Send a dummy byte */
        MSD_WriteByte(DUMMY);
        /* Send the data token to signify the start of the data */
        MSD_WriteByte(0xFE);
        /* Write the block data to MSD : write count data by block */
        for (i = 0; i < NumByteToWrite; i++)
        {
            /* Send the pointed byte */
            MSD_WriteByte(*pBuffer);
            /* Point to the next location where the byte read will be saved */
            pBuffer++;
        }
        /* Put CRC bytes (not really needed by us, but required by MSD) */
        MSD_ReadByte();
        MSD_ReadByte();
        /* Read data response */
        if (MSD_GetDataResponse() == MSD_DATA_OK)
        {
            rvalue = MSD_RESPONSE_NO_ERROR;
        }
    }

    /* MSD chip select high */
    MSD_CS_HIGH();
    /* Send dummy byte: 8 Clock pulses of delay */
    MSD_WriteByte(DUMMY);
    /* Returns the reponse */
    return rvalue;
}

/*******************************************************************************
* Function Name  : MSD_ReadBlock
* Description    : Reads a block of data from the MSD.
* Input          : - pBuffer : pointer to the buffer that receives the data read
*                    from the MSD.
*                  - ReadAddr : MSD's internal address to read from.
*                  - NumByteToRead : number of bytes to read from the MSD.
* Output         : None
* Return         : The MSD Response: - MSD_RESPONSE_FAILURE: Sequence failed
*                                    - MSD_RESPONSE_NO_ERROR: Sequence succeed
*******************************************************************************/
u8 MSD_ReadBlock(u8 *pBuffer, u32 ReadAddr, u16 NumByteToRead)
{
    u32 i = 0;
    u8 rvalue = MSD_RESPONSE_FAILURE;

    /* MSD chip select low */
    MSD_CS_LOW();
    /* Send CMD17 (MSD_READ_SINGLE_BLOCK) to read one block */
    MSD_SendCmd(MSD_READ_SINGLE_BLOCK, ReadAddr, 0xFF);

    /* Check if the MSD acknowledged the read block command: R1 response (0x00: no errors) */
    if (!MSD_GetResponse(MSD_RESPONSE_NO_ERROR))
    {
        /* Now look for the data token to signify the start of the data */
        if (!MSD_GetResponse(MSD_START_DATA_SINGLE_BLOCK_READ))
        {
            /* Read the MSD block data : read NumByteToRead data */
            for (i = 0; i < NumByteToRead; i++)
            {
                /* Save the received data */
                *pBuffer = MSD_ReadByte();
                /* Point to the next location where the byte read will be saved */
                pBuffer++;
            }
            /* Get CRC bytes (not really needed by us, but required by MSD) */
            MSD_ReadByte();
            MSD_ReadByte();
            /* Set response value to success */
            rvalue = MSD_RESPONSE_NO_ERROR;
        }
    }

    /* MSD chip select high */
    MSD_CS_HIGH();
    /* Send dummy byte: 8 Clock pulses of delay */
    MSD_WriteByte(DUMMY);
    /* Returns the reponse */
    return rvalue;
}

