prife/stm32f10x_demo/drivers/msd.c
/*******************************************************************************
* Function Name  : MSD_WriteBuffer
* Description    : Writes many blocks on the MSD
* Input          : - pBuffer : pointer to the buffer containing the data to be
*                    written on the MSD.
*                  - WriteAddr : address to write on.
*                  - NumByteToWrite: number of data to write
* Output         : None
* Return         : The MSD Response: - MSD_RESPONSE_FAILURE: Sequence failed
*                                    - MSD_RESPONSE_NO_ERROR: Sequence succeed
*******************************************************************************/
u8 MSD_WriteBuffer(u8 *pBuffer, u32 WriteAddr, u32 NumByteToWrite)
{
    u32 i = 0, NbrOfBlock = 0, Offset = 0;
    u8 rvalue = MSD_RESPONSE_FAILURE;

    /* Calculate number of blocks to write */
    NbrOfBlock = NumByteToWrite / BLOCK_SIZE;
    /* MSD chip select low */
    MSD_CS_LOW();

    /* Data transfer */
    while (NbrOfBlock --)
    {
        /* Send CMD24 (MSD_WRITE_BLOCK) to write blocks */
        MSD_SendCmd(MSD_WRITE_BLOCK, WriteAddr + Offset, 0xFF);

        /* Check if the MSD acknowledged the write block command: R1 response (0x00: no errors) */
        if (MSD_GetResponse(MSD_RESPONSE_NO_ERROR))
        {
            return MSD_RESPONSE_FAILURE;
        }
        /* Send dummy byte */
        MSD_WriteByte(DUMMY);
        /* Send the data token to signify the start of the data */
        MSD_WriteByte(MSD_START_DATA_SINGLE_BLOCK_WRITE);
        /* Write the block data to MSD : write count data by block */
        for (i = 0; i < BLOCK_SIZE; i++)
        {
            /* Send the pointed byte */
            MSD_WriteByte(*pBuffer);
            /* Point to the next location where the byte read will be saved */
            pBuffer++;
        }
        /* Set next write address */
        Offset += 512;
        /* Put CRC bytes (not really needed by us, but required by MSD) */
        MSD_ReadByte();
        MSD_ReadByte();
        /* Read data response */
        if (MSD_GetDataResponse() == MSD_DATA_OK)
        {
            /* Set response value to success */
            rvalue = MSD_RESPONSE_NO_ERROR;
        }
        else
        {
            /* Set response value to failure */
            rvalue = MSD_RESPONSE_FAILURE;
        }
    }

    /* MSD chip select high */
    MSD_CS_HIGH();
    /* Send dummy byte: 8 Clock pulses of delay */
    MSD_WriteByte(DUMMY);
    /* Returns the reponse */
    return rvalue;
}

/*******************************************************************************
* Function Name  : MSD_ReadBuffer
* Description    : Reads multiple block of data from the MSD.
* Input          : - pBuffer : pointer to the buffer that receives the data read
*                    from the MSD.
*                  - ReadAddr : MSD's internal address to read from.
*                  - NumByteToRead : number of bytes to read from the MSD.
* Output         : None
* Return         : The MSD Response: - MSD_RESPONSE_FAILURE: Sequence failed
*                                    - MSD_RESPONSE_NO_ERROR: Sequence succeed
*******************************************************************************/
u8 MSD_ReadBuffer(u8 *pBuffer, u32 ReadAddr, u32 NumByteToRead)
{
    u32 i = 0, NbrOfBlock = 0, Offset = 0;
    u8 rvalue = MSD_RESPONSE_FAILURE;

    /* Calculate number of blocks to read */
    NbrOfBlock = NumByteToRead / BLOCK_SIZE;
    /* MSD chip select low */
    MSD_CS_LOW();

    /* Data transfer */
    while (NbrOfBlock --)
    {
        /* Send CMD17 (MSD_READ_SINGLE_BLOCK) to read one block */
        MSD_SendCmd(MSD_READ_SINGLE_BLOCK, ReadAddr + Offset, 0xFF);
        /* Check if the MSD acknowledged the read block command: R1 response (0x00: no errors) */
        if (MSD_GetResponse(MSD_RESPONSE_NO_ERROR))
        {
            return  MSD_RESPONSE_FAILURE;
        }
        /* Now look for the data token to signify the start of the data */
        if (!MSD_GetResponse(MSD_START_DATA_SINGLE_BLOCK_READ))
        {
            /* Read the MSD block data : read NumByteToRead data */
            for (i = 0; i < BLOCK_SIZE; i++)
            {
                /* Read the pointed data */
                *pBuffer = MSD_ReadByte();
                /* Point to the next location where the byte read will be saved */
                pBuffer++;
            }
            /* Set next read address*/
            Offset += 512;
            /* get CRC bytes (not really needed by us, but required by MSD) */
            MSD_ReadByte();
            MSD_ReadByte();
            /* Set response value to success */
            rvalue = MSD_RESPONSE_NO_ERROR;
        }
        else
        {
            /* Set response value to failure */
            rvalue = MSD_RESPONSE_FAILURE;
        }
    }

    /* MSD chip select high */
    MSD_CS_HIGH();
    /* Send dummy byte: 8 Clock pulses of delay */
    MSD_WriteByte(DUMMY);
    /* Returns the reponse */
    return rvalue;
}

/*******************************************************************************
* Function Name  : MSD_GetCSDRegister
* Description    : Read the CSD card register.
*                  Reading the contents of the CSD register in SPI mode
*                  is a simple read-block transaction.
* Input          : - MSD_csd: pointer on an SCD register structure
* Output         : None
* Return         : The MSD Response: - MSD_RESPONSE_FAILURE: Sequence failed
*                                    - MSD_RESPONSE_NO_ERROR: Sequence succeed
*******************************************************************************/
u8 MSD_GetCSDRegister(sMSD_CSD *MSD_csd)
{
    u32 i = 0;
    u8 rvalue = MSD_RESPONSE_FAILURE;
    u8 CSD_Tab[16];

    /* MSD chip select low */
    MSD_CS_LOW();
    /* Send CMD9 (CSD register) or CMD10(CSD register) */
    MSD_SendCmd(MSD_SEND_CSD, 0, 0xFF);

    /* Wait for response in the R1 format (0x00 is no errors) */
    if (!MSD_GetResponse(MSD_RESPONSE_NO_ERROR))
    {
        if (!MSD_GetResponse(MSD_START_DATA_SINGLE_BLOCK_READ))
        {
            for (i = 0; i < 16; i++)
            {
                /* Store CSD register value on CSD_Tab */
                CSD_Tab[i] = MSD_ReadByte();
            }
        }
        /* Get CRC bytes (not really needed by us, but required by MSD) */
        MSD_WriteByte(DUMMY);
        MSD_WriteByte(DUMMY);
        /* Set response value to success */
        rvalue = MSD_RESPONSE_NO_ERROR;
    }

    /* MSD chip select high */
    MSD_CS_HIGH();
    /* Send dummy byte: 8 Clock pulses of delay */
    MSD_WriteByte(DUMMY);

    /* Byte 0 */
    MSD_csd->CSDStruct = (CSD_Tab[0] & 0xC0) >> 6;
    MSD_csd->SysSpecVersion = (CSD_Tab[0] & 0x3C) >> 2;
    MSD_csd->Reserved1 = CSD_Tab[0] & 0x03;
    /* Byte 1 */
    MSD_csd->TAAC = CSD_Tab[1] ;
    /* Byte 2 */
    MSD_csd->NSAC = CSD_Tab[2];
    /* Byte 3 */
    MSD_csd->MaxBusClkFrec = CSD_Tab[3];
    /* Byte 4 */
    MSD_csd->CardComdClasses = CSD_Tab[4] << 4;
    /* Byte 5 */
    MSD_csd->CardComdClasses |= (CSD_Tab[5] & 0xF0) >> 4;
    MSD_csd->RdBlockLen = CSD_Tab[5] & 0x0F;
    /* Byte 6 */
    MSD_csd->PartBlockRead = (CSD_Tab[6] & 0x80) >> 7;
    MSD_csd->WrBlockMisalign = (CSD_Tab[6] & 0x40) >> 6;
    MSD_csd->RdBlockMisalign = (CSD_Tab[6] & 0x20) >> 5;
    MSD_csd->DSRImpl = (CSD_Tab[6] & 0x10) >> 4;
    MSD_csd->Reserved2 = 0; /* Reserved */
    MSD_csd->DeviceSize = (CSD_Tab[6] & 0x03) << 10;
    /* Byte 7 */
    MSD_csd->DeviceSize |= (CSD_Tab[7]) << 2;
    /* Byte 8 */
    MSD_csd->DeviceSize |= (CSD_Tab[8] & 0xC0) >> 6;
    MSD_csd->MaxRdCurrentVDDMin = (CSD_Tab[8] & 0x38) >> 3;
    MSD_csd->MaxRdCurrentVDDMax = (CSD_Tab[8] & 0x07);
    /* Byte 9 */
    MSD_csd->MaxWrCurrentVDDMin = (CSD_Tab[9] & 0xE0) >> 5;
    MSD_csd->MaxWrCurrentVDDMax = (CSD_Tab[9] & 0x1C) >> 2;
    MSD_csd->DeviceSizeMul = (CSD_Tab[9] & 0x03) << 1;
    /* Byte 10 */
    MSD_csd->DeviceSizeMul |= (CSD_Tab[10] & 0x80) >> 7;
    MSD_csd->EraseGrSize = (CSD_Tab[10] & 0x7C) >> 2;
    MSD_csd->EraseGrMul = (CSD_Tab[10] & 0x03) << 3;
    /* Byte 11 */
    MSD_csd->EraseGrMul |= (CSD_Tab[11] & 0xE0) >> 5;
    MSD_csd->WrProtectGrSize = (CSD_Tab[11] & 0x1F);
    /* Byte 12 */
    MSD_csd->WrProtectGrEnable = (CSD_Tab[12] & 0x80) >> 7;
    MSD_csd->ManDeflECC = (CSD_Tab[12] & 0x60) >> 5;
    MSD_csd->WrSpeedFact = (CSD_Tab[12] & 0x1C) >> 2;
    MSD_csd->MaxWrBlockLen = (CSD_Tab[12] & 0x03) << 2;
    /* Byte 13 */
    MSD_csd->MaxWrBlockLen |= (CSD_Tab[13] & 0xc0) >> 6;
    MSD_csd->WriteBlockPaPartial = (CSD_Tab[13] & 0x20) >> 5;
    MSD_csd->Reserved3 = 0;
    MSD_csd->ContentProtectAppli = (CSD_Tab[13] & 0x01);
    /* Byte 14 */
    MSD_csd->FileFormatGrouop = (CSD_Tab[14] & 0x80) >> 7;
    MSD_csd->CopyFlag = (CSD_Tab[14] & 0x40) >> 6;
    MSD_csd->PermWrProtect = (CSD_Tab[14] & 0x20) >> 5;
    MSD_csd->TempWrProtect = (CSD_Tab[14] & 0x10) >> 4;
    MSD_csd->FileFormat = (CSD_Tab[14] & 0x0C) >> 2;
    MSD_csd->ECC = (CSD_Tab[14] & 0x03);
    /* Byte 15 */
    MSD_csd->msd_CRC = (CSD_Tab[15] & 0xFE) >> 1;
    MSD_csd->Reserved4 = 1;

    /* Return the reponse */
    return rvalue;
}

