prife/stm32f10x_demo/drivers/msd.c
/*******************************************************************************
* Function Name  : MSD_GetCIDRegister
* Description    : Read the CID card register.
*                  Reading the contents of the CID register in SPI mode
*                  is a simple read-block transaction.
* Input          : - MSD_cid: pointer on an CID register structure
* Output         : None
* Return         : The MSD Response: - MSD_RESPONSE_FAILURE: Sequence failed
*                                    - MSD_RESPONSE_NO_ERROR: Sequence succeed
*******************************************************************************/
u8 MSD_GetCIDRegister(sMSD_CID *MSD_cid)
{
    u32 i = 0;
    u8 rvalue = MSD_RESPONSE_FAILURE;
    u8 CID_Tab[16];

    /* MSD chip select low */
    MSD_CS_LOW();
    /* Send CMD10 (CID register) */
    MSD_SendCmd(MSD_SEND_CID, 0, 0xFF);

    /* Wait for response in the R1 format (0x00 is no errors) */
    if (!MSD_GetResponse(MSD_RESPONSE_NO_ERROR))
    {
        if (!MSD_GetResponse(MSD_START_DATA_SINGLE_BLOCK_READ))
        {
            /* Store CID register value on CID_Tab */
            for (i = 0; i < 16; i++)
            {
                CID_Tab[i] = MSD_ReadByte();
            }
        }
        /* Get CRC bytes (not really needed by us, but required by MSD) */
        MSD_WriteByte(DUMMY);
        MSD_WriteByte(DUMMY);
        /* Set response value to success */
        rvalue = MSD_RESPONSE_NO_ERROR;
    }

    /* MSD chip select high */
    MSD_CS_HIGH();
    /* Send dummy byte: 8 Clock pulses of delay */
    MSD_WriteByte(DUMMY);

    /* Byte 0 */
    MSD_cid->ManufacturerID = CID_Tab[0];
    /* Byte 1 */
    MSD_cid->OEM_AppliID = CID_Tab[1] << 8;
    /* Byte 2 */
    MSD_cid->OEM_AppliID |= CID_Tab[2];
    /* Byte 3 */
    MSD_cid->ProdName1 = CID_Tab[3] << 24;
    /* Byte 4 */
    MSD_cid->ProdName1 |= CID_Tab[4] << 16;
    /* Byte 5 */
    MSD_cid->ProdName1 |= CID_Tab[5] << 8;
    /* Byte 6 */
    MSD_cid->ProdName1 |= CID_Tab[6];
    /* Byte 7 */
    MSD_cid->ProdName2 = CID_Tab[7];
    /* Byte 8 */
    MSD_cid->ProdRev = CID_Tab[8];
    /* Byte 9 */
    MSD_cid->ProdSN = CID_Tab[9] << 24;
    /* Byte 10 */
    MSD_cid->ProdSN |= CID_Tab[10] << 16;
    /* Byte 11 */
    MSD_cid->ProdSN |= CID_Tab[11] << 8;
    /* Byte 12 */
    MSD_cid->ProdSN |= CID_Tab[12];
    /* Byte 13 */
    MSD_cid->Reserved1 |= (CID_Tab[13] & 0xF0) >> 4;
    /* Byte 14 */
    MSD_cid->ManufactDate = (CID_Tab[13] & 0x0F) << 8;
    /* Byte 15 */
    MSD_cid->ManufactDate |= CID_Tab[14];
    /* Byte 16 */
    MSD_cid->msd_CRC = (CID_Tab[15] & 0xFE) >> 1;
    MSD_cid->Reserved2 = 1;

    /* Return the reponse */
    return rvalue;
}

/*******************************************************************************
* Function Name  : MSD_SendCmd
* Description    : Send 5 bytes command to the MSD card.
* Input          : - Cmd: the user expected command to send to MSD card
*                  - Arg: the command argument
*                  - Crc: the CRC
* Output         : None
* Return         : None
*******************************************************************************/
void MSD_SendCmd(u8 Cmd, u32 Arg, u8 Crc)
{
    u32 i = 0x00;
    u8 Frame[6];

    /* Construct byte1 */
    Frame[0] = (Cmd | 0x40);
    /* Construct byte2 */
    Frame[1] = (u8)(Arg >> 24);
    /* Construct byte3 */
    Frame[2] = (u8)(Arg >> 16);
    /* Construct byte4 */
    Frame[3] = (u8)(Arg >> 8);
    /* Construct byte5 */
    Frame[4] = (u8)(Arg);
    /* Construct CRC: byte6 */
    Frame[5] = (Crc);

    /* Send the Cmd bytes */
    for (i = 0; i < 6; i++)
    {
        MSD_WriteByte(Frame[i]);
    }
}

/*******************************************************************************
* Function Name  : MSD_GetDataResponse
* Description    : Get MSD card data response.
* Input          : None
* Output         : None
* Return         : The MSD status: Read data response xxx0<status>1
*                   - status 010: Data accecpted
*                   - status 101: Data rejected due to a crc error
*                   - status 110: Data rejected due to a Write error.
*                   - status 111: Data rejected due to other error.
*******************************************************************************/
u8 MSD_GetDataResponse(void)
{
    u32 i = 0;
    u8 response, rvalue;

    while (i <= 64)
    {
        /* Read resonse */
        response = MSD_ReadByte();
        /* Mask unused bits */
        response &= 0x1F;

        switch (response)
        {
        case MSD_DATA_OK:
        {
            rvalue = MSD_DATA_OK;
            break;
        }

        case MSD_DATA_CRC_ERROR:
            return MSD_DATA_CRC_ERROR;

        case MSD_DATA_WRITE_ERROR:
            return MSD_DATA_WRITE_ERROR;

        default:
        {
            rvalue = MSD_DATA_OTHER_ERROR;
            break;
        }
        }
        /* Exit loop in case of data ok */
        if (rvalue == MSD_DATA_OK)
            break;
        /* Increment loop counter */
        i++;
    }
    /* Wait null data */
    while (MSD_ReadByte() == 0);
    /* Return response */
    return response;
}

/*******************************************************************************
* Function Name  : MSD_GetResponse
* Description    : Returns the MSD response.
* Input          : None
* Output         : None
* Return         : The MSD Response: - MSD_RESPONSE_FAILURE: Sequence failed
*                                    - MSD_RESPONSE_NO_ERROR: Sequence succeed
*******************************************************************************/
u8 MSD_GetResponse(u8 Response)
{
    u32 Count = 0xFFF;

    /* Check if response is got or a timeout is happen */
    while ((MSD_ReadByte() != Response) && Count)
    {
        Count--;
    }

    if (Count == 0)
    {
        /* After time out */
        return MSD_RESPONSE_FAILURE;
    }
    else
    {
        /* Right response got */
        return MSD_RESPONSE_NO_ERROR;
    }
}

/*******************************************************************************
* Function Name  : MSD_GetStatus
* Description    : Returns the MSD status.
* Input          : None
* Output         : None
* Return         : The MSD status.
*******************************************************************************/
u16 MSD_GetStatus(void)
{
    u16 Status = 0;

    /* MSD chip select low */
    MSD_CS_LOW();
    /* Send CMD13 (MSD_SEND_STATUS) to get MSD status */
    MSD_SendCmd(MSD_SEND_STATUS, 0, 0xFF);

    Status = MSD_ReadByte();
    Status |= (u16)(MSD_ReadByte() << 8);

    /* MSD chip select high */
    MSD_CS_HIGH();
    /* Send dummy byte 0xFF */
    MSD_WriteByte(DUMMY);

