prife/stm32f10x_demo/drivers/msd.c
    return Status;
}

/*******************************************************************************
* Function Name  : MSD_GoIdleState
* Description    : Put MSD in Idle state.
* Input          : None
* Output         : None
* Return         : The MSD Response: - MSD_RESPONSE_FAILURE: Sequence failed
*                                    - MSD_RESPONSE_NO_ERROR: Sequence succeed
*******************************************************************************/
u8 MSD_GoIdleState(void)
{
    /* MSD chip select low */
    MSD_CS_LOW();
    /* Send CMD0 (GO_IDLE_STATE) to put MSD in SPI mode */
    MSD_SendCmd(MSD_GO_IDLE_STATE, 0, 0x95);

    /* Wait for In Idle State Response (R1 Format) equal to 0x01 */
    if (MSD_GetResponse(MSD_IN_IDLE_STATE))
    {
        /* No Idle State Response: return response failue */
        return MSD_RESPONSE_FAILURE;
    }
    /*----------Activates the card initialization process-----------*/
    do
    {
        /* MSD chip select high */
        MSD_CS_HIGH();
        /* Send Dummy byte 0xFF */
        MSD_WriteByte(DUMMY);

        /* MSD chip select low */
        MSD_CS_LOW();

        /* Send CMD1 (Activates the card process) until response equal to 0x0 */
        MSD_SendCmd(MSD_SEND_OP_COND, 0, 0xFF);
        /* Wait for no error Response (R1 Format) equal to 0x00 */
    }
    while (MSD_GetResponse(MSD_RESPONSE_NO_ERROR));

    /* MSD chip select high */
    MSD_CS_HIGH();
    /* Send dummy byte 0xFF */
    MSD_WriteByte(DUMMY);

    return MSD_RESPONSE_NO_ERROR;
}

/*******************************************************************************
* Function Name  : MSD_WriteByte
* Description    : Write a byte on the MSD.
* Input          : Data: byte to send.
* Output         : None
* Return         : None.
*******************************************************************************/
void MSD_WriteByte(u8 Data)
{
    /* Wait until the transmit buffer is empty */
    while (SPI_I2S_GetFlagStatus(MSD_SPI, SPI_I2S_FLAG_TXE) == RESET);
    /* Send the byte */
    SPI_I2S_SendData(MSD_SPI, Data);

    /*!< Wait to receive a byte*/
    while (SPI_I2S_GetFlagStatus(MSD_SPI, SPI_I2S_FLAG_RXNE) == RESET);
    /*!< Return the byte read from the SPI bus */
    SPI_I2S_ReceiveData(MSD_SPI);
}

/*******************************************************************************
* Function Name  : MSD_ReadByte
* Description    : Read a byte from the MSD.
* Input          : None.
* Output         : None
* Return         : The received byte.
*******************************************************************************/
u8 MSD_ReadByte(void)
{
    u8 Data = 0;

    /* Wait until the transmit buffer is empty */
    while (SPI_I2S_GetFlagStatus(MSD_SPI, SPI_I2S_FLAG_TXE) == RESET);
    /* Send the byte */
    SPI_I2S_SendData(MSD_SPI, DUMMY);

    /* Wait until a data is received */
    while (SPI_I2S_GetFlagStatus(MSD_SPI, SPI_I2S_FLAG_RXNE) == RESET);
    /* Get the received data */
    Data = SPI_I2S_ReceiveData(MSD_SPI);

    /* Return the shifted data */
    return Data;
}

/*******************************************************************************
* Function Name  : SPI_Config
* Description    : Initializes the SPI and CS pins.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void SPI_Config(void)
{
    uint32_t delay;
    GPIO_InitTypeDef  GPIO_InitStructure;
    SPI_InitTypeDef   SPI_InitStructure;

    /* GPIOA and GPIOC Periph clock enable */
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_MSD_CS | RCC_APB2Periph_SD_PWR, ENABLE);
    /* SPI Periph clock enable */
    RCC_APB2PeriphClockCmd(MSD_RCC_SPI, ENABLE);

    /* Configure SPI pins: SCK, MISO and MOSI */
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_5 | GPIO_Pin_6 | GPIO_Pin_7;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_Init(GPIOA, &GPIO_InitStructure);

    /* Configure SD Power */
    GPIO_InitStructure.GPIO_Pin = SD_PWR_PIN;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
    GPIO_Init(SD_PWR_PORT, &GPIO_InitStructure);

    /* Configure SD CS pin */
    GPIO_InitStructure.GPIO_Pin = MSD_CS_PIN;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
    GPIO_Init(MSD_CS_PORT, &GPIO_InitStructure);

    /* SPI Config */
    SPI_InitStructure.SPI_Direction = SPI_Direction_2Lines_FullDuplex;
    SPI_InitStructure.SPI_Mode = SPI_Mode_Master;
    SPI_InitStructure.SPI_DataSize = SPI_DataSize_8b;
    SPI_InitStructure.SPI_CPOL = SPI_CPOL_High;
    SPI_InitStructure.SPI_CPHA = SPI_CPHA_2Edge;
    SPI_InitStructure.SPI_NSS = SPI_NSS_Soft;
    SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_4;
    SPI_InitStructure.SPI_FirstBit = SPI_FirstBit_MSB;
    SPI_InitStructure.SPI_CRCPolynomial = 7;
    SPI_Init(MSD_SPI, &SPI_InitStructure);

    /* SPI enable */
    SPI_Cmd(MSD_SPI, ENABLE);

    /* active SD card */
    sd_power_on();

    for (delay = 0; delay < 0xfffff; delay ++);
}

/******************* (C) COPYRIGHT 2008 STMicroelectronics *****END OF FILE****/

/*
 * RT-Thread SD Card Driver
 * 2009-04-17 Bernard first version
 * 2010-07-15 Modify read/write according new block driver interface
 */
#include <rtthread.h>
#include <dfs_fs.h>

static struct rt_device sdcard_device;
static struct dfs_partition part;

#define SECTOR_SIZE 512

/* RT-Thread Device Driver Interface */
static rt_err_t rt_msd_init(rt_device_t dev)
{
    sMSD_CSD MSD_csd;
    MSD_GetCSDRegister(&MSD_csd);

    return RT_EOK;
}

static rt_err_t rt_msd_open(rt_device_t dev, rt_uint16_t oflag)
{
    return RT_EOK;
}

static rt_err_t rt_msd_close(rt_device_t dev)
{
    return RT_EOK;
}

static rt_size_t rt_msd_read(rt_device_t dev, rt_off_t pos, void *buffer, rt_size_t size)
{
    rt_uint8_t status;
    rt_uint32_t i;

    status = MSD_RESPONSE_NO_ERROR;
    // rt_kprintf("read: 0x%x, size %d\n", pos, size);

    /* read all sectors */
    for (i = 0; i < size; i ++)
    {
        status = MSD_ReadBlock((rt_uint8_t *)((rt_uint8_t *)buffer + i * SECTOR_SIZE),
                               (part.offset + pos + i) * SECTOR_SIZE, SECTOR_SIZE);
        if (status != MSD_RESPONSE_NO_ERROR)
        {
            rt_kprintf("sd card read failed\n");
            return 0;
        }
    }

