prife/stm32f10x_demo/drivers/msd.c
    if (status == MSD_RESPONSE_NO_ERROR) return size;

    rt_kprintf("read failed: %d\n", status);
    return 0;
}

static rt_size_t rt_msd_write(rt_device_t dev, rt_off_t pos, const void *buffer, rt_size_t size)
{
    rt_uint8_t status;
    rt_uint32_t i;

    status = MSD_RESPONSE_NO_ERROR;
    // rt_kprintf("write: 0x%x, size %d\n", pos, size);

    /* write all sectors */
    for (i = 0; i < size; i ++)
    {
        status = MSD_WriteBuffer((rt_uint8_t *)((rt_uint8_t *)buffer + i * SECTOR_SIZE),
                                 (part.offset + pos + i) * SECTOR_SIZE, SECTOR_SIZE);
        if (status != MSD_RESPONSE_NO_ERROR)
        {
            rt_kprintf("sd card write failed\n");
            return 0;
        }
    }

    if (status == MSD_RESPONSE_NO_ERROR) return size;

    rt_kprintf("write failed: %d\n", status);
    return 0;
}

static rt_err_t rt_msd_control(rt_device_t dev, rt_uint8_t cmd, void *args)
{
    RT_ASSERT(dev != RT_NULL);

    return RT_EOK;
}

/* init SD detected pin */
static void sd_detectpin_init(void)
{
    GPIO_InitTypeDef  GPIO_InitStructure;

    /* GPIOG Periph clock enable */
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_SD_CD, ENABLE);

    /* Configure SD detected pin */
    GPIO_InitStructure.GPIO_Pin = SD_CD_PIN;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
    GPIO_Init(SD_CD_PORT, &GPIO_InitStructure);
}

int SD_IS_INSTALLED(void)
{
    return (GPIO_ReadInputDataBit(SD_CD_PORT,  SD_CD_PIN) == 0);
}

void rt_hw_msd_init()
{
    sd_detectpin_init();

    /* check SD CARD inserted or not */
    if (!SD_IS_INSTALLED())
    {
        rt_kprintf("SD CARD not inserted!\n");
        return;
    }

    if (MSD_Init() == MSD_RESPONSE_NO_ERROR)
    {
        rt_uint8_t status;
        rt_uint8_t *sector;

        /* register sdcard device */
        sdcard_device.init  = rt_msd_init;
        sdcard_device.open  = rt_msd_open;
        sdcard_device.close = rt_msd_close;
        sdcard_device.read  = rt_msd_read;
        sdcard_device.write = rt_msd_write;
        sdcard_device.control = rt_msd_control;

        /* no private */
        sdcard_device.user_data = RT_NULL;
        /* get the first sector to read partition table */
        sector = (rt_uint8_t *) rt_malloc(512);
        if (sector == RT_NULL)
        {
            rt_kprintf("allocate partition sector buffer failed\n");
            return;
        }

        status = MSD_ReadBlock(sector, 0, 512);
        if (status == MSD_RESPONSE_NO_ERROR)
        {
            /* get the first partition */
            status = dfs_filesystem_get_partition(&part, sector, 0);
            if (status != RT_EOK)
            {
                /* there is no partition table */
                part.offset = 0;
                part.size   = 0;
            }
        }
        else
        {
            /* there is no partition table */
            part.offset = 0;
            part.size   = 0;
        }

        /* release sector buffer */
        rt_free(sector);

        rt_device_register(&sdcard_device, "sd0",
                           RT_DEVICE_FLAG_RDWR | RT_DEVICE_FLAG_REMOVABLE | RT_DEVICE_FLAG_STANDALONE);
    }
    else
    {
        rt_kprintf("sdcard init failed\n");
    }
}

unsigned int rt_hw_msd_get_size(void)
{
    unsigned int size_in_bytes;

    if ((part.size>>11) > 0) /* MB */
    {
        unsigned int part_size;
        part_size = part.size >> 11;/* MB */
        size_in_bytes = part_size * (1024 * 1024);
    }
    else
    {
        size_in_bytes = (part.size>>1) * 1024;
    }

    return size_in_bytes;
}
